*--------------------------------------------------*
* LAYOUT-CUSTOMER.CPY                              *
* Customer record layout                           *
*--------------------------------------------------*
     01 CUSTOMER-REC.
        05 CUST-ID        PIC 9(08).
        05 CUST-NAME      PIC X(30).
        05 CUST-STATUS    PIC X(01).
