IDENTIFICATION DIVISION.
PROGRAM-ID. LIST-CUSTOMERS.
AUTHOR. LEANDRO BASILE.
INSTALLATION. GITHUB-EXAMPLE.
DATE-WRITTEN. 2025-08-11.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT CUSTOMER-FILE ASSIGN TO "data/customers_in.txt"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  CUSTOMER-FILE.
COPY 'copybooks/LAYOUT-CUSTOMER.cpy'.

WORKING-STORAGE SECTION.
01 WS-END-FILE      PIC X VALUE 'N'.

PROCEDURE DIVISION.
MAIN-LOGIC.
    OPEN INPUT CUSTOMER-FILE
    PERFORM UNTIL WS-END-FILE = 'S'
        READ CUSTOMER-FILE
            AT END
                MOVE 'S' TO WS-END-FILE
            NOT AT END
                DISPLAY "ID: " CUST-ID
                DISPLAY "Name: " CUST-NAME
                DISPLAY "Status: " CUST-STATUS
        END-READ
    END-PERFORM
    CLOSE CUSTOMER-FILE
    STOP RUN.
