//COMPILE  JOB (ACCT),'COMPILE COBOL',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//COBSTEP  EXEC PGM=IGYCRCTL
//SYSIN    DD DISP=SHR,DSN=YOUR.SOURCE(LISTCUS)
//SYSLIN   DD DISP=SHR,DSN=YOUR.OBJ(LISTCUS)
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//LKED     EXEC PGM=IEWL,PARM='MAP,LIST,REUS'
//SYSLMOD  DD DISP=SHR,DSN=YOUR.LOADLIB
//SYSPRINT DD SYSOUT=*
