//RUNJOB   JOB (ACCT),'RUN COBOL',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//STEP1    EXEC PGM=LISTCUS,REGION=0M
//STEPLIB  DD DISP=SHR,DSN=YOUR.LOADLIB
//SYSOUT   DD SYSOUT=*
